---
kind: property
id: P:Autodesk.Revit.DB.LineProperties.Transparency
source: html/7807e7d5-be3f-2cdd-4c93-bc4881810f9c.htm
---
# Autodesk.Revit.DB.LineProperties.Transparency Property

The current transparency level to be applied to the current color.

## Syntax (C#)
```csharp
public int Transparency { get; }
```